#include <REGX52.H>
#include "mai.h"
//void trmed_int()//初始化定时器（手动配置）
//{
//	 //TMOD = 0x01; //整体赋值会影响到t1；
//	  TMOD = TMOD & 0xf0;  //低四位清零
//	  TMOD = TMOD | 0x01;//低四位赋值，初始化TMOD寄存器.用这两段初始化是为了不影响T1
//		TH0 = 64535 / 256;	//得出定时器初始所在，地址值高8位 1111 1100
//		TL0 = 64535 % 256; //得出定时器初始值所在，地址低8位  0001 0111
//		TF0 = 0;    	//当等于1时产生中断
//	  TR0 = 1;			//T0启动，等于0时关闭，相当于使能
//	  ET0 = 1;		// T0中断开关
//		EA = 1;		// 中断的总开关
//		PT0 = 0;   // 等于0 T0是低优先级，等于1 T0是低优先级（但默认为0）
//}                // 64535的二进制  1111 1100 0001 0111     

void Timer0Init()		//1毫秒@11.0592MHz
{
	// AUXR &= 0x7F;		//定时器时钟12T模式（51默认不用配置）
	TMOD &= 0xF0;		//设置定时器模式
	TMOD |= 0x01;		//设置定时器模式
	TL0 = 0x66;		//设置定时初值
	TH0 = 0xFC;		//设置定时初值
	TF0 = 0;		//清除TF0标志
	TR0 = 1;		//定时器0开始计时
	ET0 = 1;
	EA = 1;
	PT0 = 0;
}


void main()
{
	Timer0Init();
		while(1)
		{
		     int i = 1;//0000 0001
			   char*pp = (char*)&i;//int首地址是从低地址开始的，int占两个字节，char占1个字节
			  // P2_1 = *pp;
			P2_1 = *(pp+1);//低位的1存到了int中的高位地址，所以这个单片机为大端存储
			   Delay(500);//pp+1后*pp才等于了1
			   P2_1 = 0;
			   Delay(500);
		}

}
unsigned int cont;
void Timer0_Rountine() interrupt 1 //64535~65535，为1000us = 1 ms;（晶振为12m/hz）
{
//	  TH0 = 64535 / 256;//中断后重新赋初始值	
//		TL0 = 64535 % 256;
	TL0 = 0x66;		//设置定时初值
	TH0 = 0xFC;		//设置定时初值
		cont++;
		if(cont >= 500) //1000ms = 1s;
		{
				cont = 0;
				P2_0 =~ P2_0 ;//1
		}
	
}
